In [1]:
import pandas as pd
import matplotlib.pyplot as plt

NameError: name 'end' is not defined

In [2]:
oly = pd.read_excel("Olympic_data2.xlsx")("C:\Users\sobod\OneDrive\Desktop\2023 Polls_main.xlsx")

In [3]:
oly.isnull().sum()

ID                     1
Name                   0
Sex                    0
Age                    0
Height             51574
Weight             54263
Team                   0
NOC                    0
Origin Country       356
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal             222591
Unnamed: 16       261642
Unnamed: 17       261495
Unnamed: 18       261495
dtype: int64

In [4]:
oly.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Origin Country,Games,Year,Season,City,Sport,Event,Medal,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,1.0,A Dijiang,M,24,180.0,80.0,China,CHN,China,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,NaN,NOC,region
1,2.0,A Lamusi,M,23,170.0,60.0,China,CHN,China,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,NaN,AFG,Afghanistan
2,3.0,Gunnar Nielsen Aaby,M,24,NaN,NaN,Denmark,DEN,Denmark,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN,NaN,AHO,Curacao
3,4.0,Edgar Lindenau Aabye,M,34,NaN,NaN,Denmark/Sweden,DEN,Denmark,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,NaN,ALB,Albania
4,5.0,Christine Jacoba Aaftink,F,21,185.0,82.0,Netherlands,NED,Netherlands,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,NaN,ALG,Algeria

In [5]:
oly.drop('Unnamed: 16', axis=1, inplace=True)

In [6]:
oly.drop('Unnamed: 17', axis=1, inplace=True)

In [7]:
oly.drop('Unnamed: 18', axis=1, inplace=True)

In [8]:
oly.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Origin Country,Games,Year,Season,City,Sport,Event,Medal
0,1.0,A Dijiang,M,24,180.0,80.0,China,CHN,China,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2.0,A Lamusi,M,23,170.0,60.0,China,CHN,China,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3.0,Gunnar Nielsen Aaby,M,24,NaN,NaN,Denmark,DEN,Denmark,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4.0,Edgar Lindenau Aabye,M,34,NaN,NaN,Denmark/Sweden,DEN,Denmark,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5.0,Christine Jacoba Aaftink,F,21,185.0,82.0,Netherlands,NED,Netherlands,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [9]:
int(oly["Height"].mean())

175

In [10]:
oly["Height"].fillna(int(oly["Height"].mean()), inplace=True)

In [11]:
int(oly["Weight"].mean())

70

In [12]:
oly["Weight"].fillna(int(oly["Weight"].mean()), inplace=True)

In [13]:
oly.dropna(subset=["ID"], inplace=True)
oly.dropna(subset=["Origin Country"], inplace=True)

In [14]:
oly.isnull().sum()

ID                     0
Name                   0
Sex                    0
Age                    0
Height                 0
Weight                 0
Team                   0
NOC                    0
Origin Country         0
Games                  0
Year                   0
Season                 0
City                   0
Sport                  0
Event                  0
Medal             222244
dtype: int64

In [15]:
oly.describe()

,ID,Age,Height,Weight,Year
count,261285.000000,261285.000000,261285.000000,261285.000000,261285.000000
mean,68272.258564,25.560009,175.286848,70.570993,1980.082462
std,38993.050876,6.392587,9.432748,12.788639,28.634825
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34736.000000,21.000000,170.000000,63.000000,1964.000000
50%,68177.000000,24.000000,175.000000,70.000000,1988.000000
75%,102086.000000,28.000000,180.000000,76.000000,2004.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [16]:
oly.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 261285 entries, 0 to 261641
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID              261285 non-null  float64
 1   Name            261285 non-null  object
 2   Sex             261285 non-null  object
 3   Age             261285 non-null  int64
 4   Height          261285 non-null  float64
 5   Weight          261285 non-null  float64
 6   Team            261285 non-null  object
 7   NOC             261285 non-null  object
 8   Origin Country  261285 non-null  object
 9   Games           261285 non-null  object
 10  Year            261285 non-null  int64
 11  Season          261285 non-null  object
 12  City            261285 non-null  object
 13  Sport           261285 non-null  object
 14  Event           261285 non-null  object
 15  Medal           39041 non-null   object
dtypes: float64(3), int64(2), object(11)
memory usage: 33.9+ MB

In [17]:
oly.shape

(261285, 16)

In [18]:
oly.Medal.value_counts()

Gold      13223
Bronze    13002
Silver    12816
Name: Medal, dtype: int64

In [19]:
oly.Sex.value_counts()

M    187323
F     73962
Name: Sex, dtype: int64

In [20]:
oly.Season.value_counts()

Summer    213006
Winter     48279
Name: Season, dtype: int64

In [21]:
oly.Sport.value_counts()

Athletics        37467
Gymnastics       25524
Swimming         22524
Shooting         10611
Cycling          10181
                 ...
Racquets            12
Jeu De Paume        11
Roque                3
Basque Pelota        2
Aeronautics          1
Name: Sport, Length: 66, dtype: int64

In [22]:
oly.City.value_counts()

London                    20565
Athens                    14625
Sydney                    13797
Atlanta                   13737
Rio de Janeiro            13643
Beijing                   13561
Barcelona                 12897
Seoul                     11904
Los Angeles               11897
Munich                    10199
Montreal                   8596
Mexico City                8483
Helsinki                   7988
Roma                       7901
Tokyo                      7659
Moskva                     7005
Berlin                     6304
Paris                      5294
Sochi                      4891
Vancouver                  4402
Torino                     4382
Melbourne                  4214
Stockholm                  4142
Amsterdam                  4119
Salt Lake City             4109
Innsbruck                  3615
Nagano                     3603
Antwerpen                  3447
Albertville                3435
Lillehammer                3158
Calgary                    2635
Sarajevo                   2123
Lake Placid                2074
Grenoble                   1872
Sapporo                    1652
Sankt Moritz               1563
Cortina d'Ampezzo          1282
Squaw Valley               1108
Oslo                       1088
St. Louis                  1027
Garmisch-Partenkirchen      884
Chamonix                    403
Athina                        2
Name: City, dtype: int64

In [23]:
print("The Max height is:", oly.Height.max(),"cm")
print("The Min height is:", oly.Height.min(),"cm")
print("The Max weight is:", oly.Weight.max(),"kg")
print("The Max weight is:", oly.Weight.min(),"kg")

The Max height is: 226.0 cm
The Min height is: 127.0 cm
The Max weight is: 214.0 kg
The Max weight is: 25.0 kg

In [24]:
oly.to_excel("OlymData#.xlsx")

In [ ]:
import numpy as np
nd= np.random.normal(loc=5,scale=3.0,size=1000)
plt.hist(nd)

plt.show()

In [ ]:
x=np.array([30,25,10,15])
print("Mean of x =",x.mean())
plt.pie(x)
plt.show()